app/views/grades/show.html.erb

SELECT "students".* FROM "students" WHERE "students"."grade_id" = ?  [["grade_id", 1]]
---

	<% @grade.students.each  do  |stu|  %>