app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("name", "age", "grade_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "lu"], ["age", 11], ["grade_id", 1], ["created_at", "2017-08-07 10:50:00.704799"], ["updated_at", "2017-08-07 10:50:00.704799"]]